AzureActivity
| where CategoryValue == "Administrative"
| where OperationNameValue has "Microsoft.Authorization/roleAssignments/write"
| project TimeGenerated, Caller, OperationNameValue, ActivityStatusValue, ResourceGroup, _ResourceId
| sort by TimeGenerated desc